# Experiencing anomalies of un-normalized database

### For each cell, please writing down your SQL statements as requested.

### Creating an Employees table that has the same schema as Slide #2 of Lecture Slides-1. 

(S:SSN, N: Name, L: Lot number, R: Rating, W: Wage, H: Hourly_worked); Primary key is SSN.

In [4]:
import getpass
# This collects a masked password from the user
mypasswd = getpass.getpass()

········

In [96]:
# List your SQL statement for table creation here 
import psycopg2 
import numpy as np 
import pandas as pd 
from psycopg2.extensions import adapt, register_adapter, AsIs

connection = psycopg2.connect(database = 'dsa_student', 
                              user = 'may96c', 
                              host = 'pgsql.dsa.lan',
                              password = mypasswd)

cursor = connection.cursor()

In [7]:
sqlCreateTable = """
CREATE TABLE IF NOT EXISTS may96c.employees (
    S VARCHAR PRIMARY KEY, 
    N VARCHAR,
    L INT ,
    R INT ,
    W INT ,
    H INT) ; """
    
    
cursor.execute(sqlCreateTable)

connection.commit()

### Insert 20 tuples that have even distributions of ratings from 1 to 5.

The only company policy provided by your client is "employees have the same rating should have the same wage."

Show all tuples and sort them based on rating in ascending order.

In [29]:
# List your SQL statements for INSERT and list all tuples

data = {'S':['111-11-1111','222-22-2222','333-33-3333','444-44-4444','555-55-5555','666-66-6666','777-77-7777','888-88-8888','999-99-9999','111-11-1112','222-22-2223','333-33-3334','444-44-4445','555-55-5556','777-77-7778','888-88-8889','999-99-9991','101-11-1010','101-11-1011','454-44-5555'],'N':['mary', 'amy', 'john', 'dana', 'ian', 'erin', 'alicia', 'stephanie', 'adam', 'gary', 'mason', 'colin', 'jerry', 'roger', 'jesse', 'cody', 'cara', 'kim', 'kenny', 'jim'],'L':[33,33,33,34,34,34,35,35,35,36,36,36,37,37,37,38,38,39,40,41],'R':[1,1,1,1,2,2,2,2,3,3,3,3,4,4,4,4,5,5,5,5],'W':[10,10,10,10,11,11,11,11,12,12,12,12,13,13,13,13,14,14,14,14],'H':[30,30,30,30,31,31,31,31,32,32,32,32,33,33,33,33,40,40,40,40]}
df = pd.DataFrame(data)
df

              S          N   L  R   W   H
0   111-11-1111       mary  33  1  10  30
1   222-22-2222        amy  33  1  10  30
2   333-33-3333       john  33  1  10  30
3   444-44-4444       dana  34  1  10  30
4   555-55-5555        ian  34  2  11  31
5   666-66-6666       erin  34  2  11  31
6   777-77-7777     alicia  35  2  11  31
7   888-88-8888  stephanie  35  2  11  31
8   999-99-9999       adam  35  3  12  32
9   111-11-1112       gary  36  3  12  32
10  222-22-2223      mason  36  3  12  32
11  333-33-3334      colin  36  3  12  32
12  444-44-4445      jerry  37  4  13  33
13  555-55-5556      roger  37  4  13  33
14  777-77-7778      jesse  37  4  13  33
15  888-88-8889       cody  38  4  13  33
16  999-99-9991       cara  38  5  14  40
17  101-11-1010        kim  39  5  14  40
18  101-11-1011      kenny  40  5  14  40
19  454-44-5555        jim  41  5  14  40

In [30]:
print(list(df))
s = ''
for i in list(df):
    s += '%s,'
print(s)

['S', 'N', 'L', 'R', 'W', 'H']
%s,%s,%s,%s,%s,%s,

In [33]:
register_adapter(np.int64,AsIs)
register_adapter(np.float64,AsIs)


# Note, we leave out the sequential counter.  
# Review the table definition above for the default value
INSERT_SQL = 'INSERT INTO may96c.employees '
INSERT_SQL += ' (S, N, L, R, W, H) VALUES '

# this is a parameterized string for SQL, the %s are placeholders
# this prevents SQL-Injection attacks on the code
# https://en.wikipedia.org/wiki/SQL_injection
INSERT_SQL += '(%s,%s,%s,%s,%s,%s)'


with connection, connection.cursor() as cursor:
    for row in df.itertuples(index=False, name=None): 
    
    
        cursor.execute(INSERT_SQL,row)

In [37]:
alll = 'SELECT * FROM may96c.employees'
cursor.execute(alll)
cursor.fetchall()

[('111-11-1111', 'mary', 33, 1, 10, 30),
 ('222-22-2222', 'amy', 33, 1, 10, 30),
 ('333-33-3333', 'john', 33, 1, 10, 30),
 ('444-44-4444', 'dana', 34, 1, 10, 30),
 ('555-55-5555', 'ian', 34, 2, 11, 31),
 ('666-66-6666', 'erin', 34, 2, 11, 31),
 ('777-77-7777', 'alicia', 35, 2, 11, 31),
 ('888-88-8888', 'stephanie', 35, 2, 11, 31),
 ('999-99-9999', 'adam', 35, 3, 12, 32),
 ('111-11-1112', 'gary', 36, 3, 12, 32),
 ('222-22-2223', 'mason', 36, 3, 12, 32),
 ('333-33-3334', 'colin', 36, 3, 12, 32),
 ('444-44-4445', 'jerry', 37, 4, 13, 33),
 ('555-55-5556', 'roger', 37, 4, 13, 33),
 ('777-77-7778', 'jesse', 37, 4, 13, 33),
 ('888-88-8889', 'cody', 38, 4, 13, 33),
 ('999-99-9991', 'cara', 38, 5, 14, 40),
 ('101-11-1010', 'kim', 39, 5, 14, 40),
 ('101-11-1011', 'kenny', 40, 5, 14, 40),
 ('454-44-5555', 'jim', 41, 5, 14, 40)]

### Copy this Employees Table to Keep_Employees Table .

Hint: Using CREATE TABLE new_table AS SELECT * FROM original_table;

In [36]:
# SQL Statement

sqlCreateTable1 = """ CREATE TABLE may96c.Keep_Employees AS SELECT * FROM may96c.employees """
    
    
cursor.execute(sqlCreateTable1)

connection.commit()

### Task 1: Use UPDATE statement on the original table (Employees) to give a raise to an employee to a new and extremely high wage. Assuming this wage is much higher than the max wage you have in the database.

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be UPDATE anomalies you experience here.

In [42]:
# SQL statement

up = '''UPDATE may96c.employees SET W = 30 WHERE S = '454-44-5555';'''
cursor.execute(up)

connection.commit()

In [43]:
# Add your comments

all2 = 'SELECT * FROM may96c.employees ORDER BY R ASC'
cursor.execute(all2)
cursor.fetchall()

[('111-11-1111', 'mary', 33, 1, 10, 30),
 ('222-22-2222', 'amy', 33, 1, 10, 30),
 ('333-33-3333', 'john', 33, 1, 10, 30),
 ('444-44-4444', 'dana', 34, 1, 10, 30),
 ('555-55-5555', 'ian', 34, 2, 11, 31),
 ('666-66-6666', 'erin', 34, 2, 11, 31),
 ('777-77-7777', 'alicia', 35, 2, 11, 31),
 ('888-88-8888', 'stephanie', 35, 2, 11, 31),
 ('999-99-9999', 'adam', 35, 3, 12, 32),
 ('111-11-1112', 'gary', 36, 3, 12, 32),
 ('222-22-2223', 'mason', 36, 3, 12, 32),
 ('333-33-3334', 'colin', 36, 3, 12, 32),
 ('444-44-4445', 'jerry', 37, 4, 13, 33),
 ('555-55-5556', 'roger', 37, 4, 13, 33),
 ('777-77-7778', 'jesse', 37, 4, 13, 33),
 ('888-88-8889', 'cody', 38, 4, 13, 33),
 ('999-99-9991', 'cara', 38, 5, 14, 40),
 ('101-11-1010', 'kim', 39, 5, 14, 40),
 ('101-11-1011', 'kenny', 40, 5, 14, 40),
 ('454-44-5555', 'jim', 41, 5, 30, 40)]

In [ ]:
print('company policy is not being preserved here as individuals with the same rating are not receiving the same pay, this anomoly is the result of the partial update we executed ')

### Task 2: Use INSERT statement on the original table (Employees) for two new employees. One follows the company policy to assign known wage and rating pair. The other is assigned a rating "5" but with a NULL value for the wage - the hiring manager has not decided the wage yet.  

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be INSERT anomalies you experience here.

In [45]:
# SQL statement


up = '''INSERT INTO may96c.employees (S,N,L,R,W,H) VALUES ('818-18-8181', 'tim', 34, 4, 13, 31)'''
cursor.execute(up)

connection.commit()

In [46]:
upu = '''INSERT INTO may96c.employees (S,N,L,R,H) VALUES ('818-18-8182', 'liz', 34, 5, 31)'''
cursor.execute(upu)

connection.commit()

In [47]:
# Add your comments


all3 = 'SELECT * FROM may96c.employees ORDER BY R ASC'
cursor.execute(all3)
cursor.fetchall()

[('222-22-2222', 'amy', 33, 1, 10, 30),
 ('333-33-3333', 'john', 33, 1, 10, 30),
 ('444-44-4444', 'dana', 34, 1, 10, 30),
 ('111-11-1111', 'mary', 33, 1, 10, 30),
 ('555-55-5555', 'ian', 34, 2, 11, 31),
 ('666-66-6666', 'erin', 34, 2, 11, 31),
 ('777-77-7777', 'alicia', 35, 2, 11, 31),
 ('888-88-8888', 'stephanie', 35, 2, 11, 31),
 ('333-33-3334', 'colin', 36, 3, 12, 32),
 ('999-99-9999', 'adam', 35, 3, 12, 32),
 ('111-11-1112', 'gary', 36, 3, 12, 32),
 ('222-22-2223', 'mason', 36, 3, 12, 32),
 ('777-77-7778', 'jesse', 37, 4, 13, 33),
 ('888-88-8889', 'cody', 38, 4, 13, 33),
 ('555-55-5556', 'roger', 37, 4, 13, 33),
 ('818-18-8181', 'tim', 34, 4, 13, 31),
 ('444-44-4445', 'jerry', 37, 4, 13, 33),
 ('818-18-8182', 'liz', 34, 5, None, 31),
 ('999-99-9991', 'cara', 38, 5, 14, 40),
 ('101-11-1010', 'kim', 39, 5, 14, 40),
 ('101-11-1011', 'kenny', 40, 5, 14, 40),
 ('454-44-5555', 'jim', 41, 5, 30, 40)]

In [48]:
print('once again, company policy was not upheld, as the wage should be the same for all company employees, but we can see that the entry liz, is not assaigned a wage despite being assaigned a rating. ')

once again, company policy was not upheld, as the wage should be the same for all company employees, but we can see that the entry liz, is not assaigned a wage despite being assaigned a rating.

### Task 3: Use DELETE statement on the original table (Employees) for all employees from the lowest rating due to performance issues.   

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be DELETE anomalies you experience here.

### Use INSERT statement on the original table (Employees) to add a new employee who will take the lowest rating (you just deleted) with the wage associating with that rating.

* Without looking at the Keep_Employees table, do you still remember the original wage for the lowest rating from the initial table?

In [52]:
# SQL statemen

dele = 'DELETE FROM may96c.employees WHERE R = 1' 

cursor.execute(dele)

connection.commit()

In [53]:
print('how will we know the wage associated with rating 1')

how will we know the wage associated with rating 1

In [55]:
# Add your comments
ins = '''INSERT INTO may96c.employees (S,N,L,R,W,H) VALUES ('454-45-4545', 'bob', 33, 1, 9, 35)'''
 

cursor.execute(ins)

connection.commit()

In [56]:
print('i unfortunately did not remember the wage that was supposed to be for employees with a rating of 1')

i unfortunately did not remember the wage that was supposed to be for employees with a rating of 1

### Now you have experienced the anomalies due to redundancy and functional dependency (Rating -> Wage)



## Solutions via table decomposition

### Let's decompose the Keep_Employees table into two - which two?

* CREATE these two tables and make sure primary keys are properly assigned to each table. There will be one foreign key constraint. Of course we need to populate tuples to these two tables using SQL statements (no manual way, please.)

* List the tuples from both tables based on ratings (ascending order) and comment on the numbers of tuples of these two tables.

In [58]:
# SQL statement
create1 = '''CREATE TABLE may96c.keep_employees_RW (
R int PRIMARY KEY,
W int 
);'''


cursor.execute(create1)

connection.commit()

In [59]:
create2 = '''CREATE TABLE may96c.keep_employees_SNLRH ( 
S VARCHAR PRIMARY KEY,
N varchar,
L int,
R int, 
H int,
CONSTRAINT fk_ke
    FOREIGN KEY(R)
        REFERENCES may96c.keep_employees_RW(R)
);'''


cursor.execute(create2)

connection.commit()

In [66]:
dfRW1 = df[['R','W']]

In [68]:
dfRW = dfRW1.drop_duplicates()
dfRW

    R   W
0   1  10
4   2  11
8   3  12
12  4  13
16  5  14

In [69]:
register_adapter(np.int64,AsIs)

INSERT_SQL = 'INSERT INTO may96c.keep_employees_RW '
INSERT_SQL += ' (R, W) VALUES '
INSERT_SQL += '(%s,%s)'


with connection, connection.cursor() as cursor:
    for row in dfRW.itertuples(index=False, name=None): 
    
    
        cursor.execute(INSERT_SQL,row)

In [71]:
dfSNLRH = df[['S','N','L','R','H']]
dfSNLRH

              S          N   L  R   H
0   111-11-1111       mary  33  1  30
1   222-22-2222        amy  33  1  30
2   333-33-3333       john  33  1  30
3   444-44-4444       dana  34  1  30
4   555-55-5555        ian  34  2  31
5   666-66-6666       erin  34  2  31
6   777-77-7777     alicia  35  2  31
7   888-88-8888  stephanie  35  2  31
8   999-99-9999       adam  35  3  32
9   111-11-1112       gary  36  3  32
10  222-22-2223      mason  36  3  32
11  333-33-3334      colin  36  3  32
12  444-44-4445      jerry  37  4  33
13  555-55-5556      roger  37  4  33
14  777-77-7778      jesse  37  4  33
15  888-88-8889       cody  38  4  33
16  999-99-9991       cara  38  5  40
17  101-11-1010        kim  39  5  40
18  101-11-1011      kenny  40  5  40
19  454-44-5555        jim  41  5  40

In [72]:
register_adapter(np.int64,AsIs)

INSERT_SQL = 'INSERT INTO may96c.keep_employees_SNLRH '
INSERT_SQL += ' (S,N,L,R,H) VALUES '
INSERT_SQL += '(%s,%s,%s,%s,%s)'


with connection, connection.cursor() as cursor:
    for row in dfSNLRH.itertuples(index=False, name=None): 
    
    
        cursor.execute(INSERT_SQL,row)

In [75]:

all5 = 'SELECT * FROM may96c.keep_employees_SNLRH ORDER BY R ASC'
cursor.execute(all5)
cursor.fetchall()

[('111-11-1111', 'mary', 33, 1, 30),
 ('222-22-2222', 'amy', 33, 1, 30),
 ('333-33-3333', 'john', 33, 1, 30),
 ('444-44-4444', 'dana', 34, 1, 30),
 ('555-55-5555', 'ian', 34, 2, 31),
 ('666-66-6666', 'erin', 34, 2, 31),
 ('777-77-7777', 'alicia', 35, 2, 31),
 ('888-88-8888', 'stephanie', 35, 2, 31),
 ('999-99-9999', 'adam', 35, 3, 32),
 ('111-11-1112', 'gary', 36, 3, 32),
 ('222-22-2223', 'mason', 36, 3, 32),
 ('333-33-3334', 'colin', 36, 3, 32),
 ('444-44-4445', 'jerry', 37, 4, 33),
 ('555-55-5556', 'roger', 37, 4, 33),
 ('777-77-7778', 'jesse', 37, 4, 33),
 ('888-88-8889', 'cody', 38, 4, 33),
 ('999-99-9991', 'cara', 38, 5, 40),
 ('101-11-1010', 'kim', 39, 5, 40),
 ('101-11-1011', 'kenny', 40, 5, 40),
 ('454-44-5555', 'jim', 41, 5, 40)]

In [76]:
all6 = 'SELECT * FROM may96c.keep_employees_RW ORDER BY R ASC'
cursor.execute(all6)
cursor.fetchall()

[(1, 10), (2, 11), (3, 12), (4, 13), (5, 14)]

In [77]:
# Add your comments

print('in the SNLRH table, we see 20 rows for 5 columns, in the RW table, we see a total of 5 rows for 2 columns')

in the SNLRH table, we see 20 rows for 5 columns, in the RW table, we see a total of 5 rows for 2 columns


### Tasks 4-6 will use these two new tables.

### Task 4: Use UPDATE statement to give a raise to an employee to a new and extremely high wage. Assuming this wage is much higher than the max wage you have in the database.

* Is it possible? Comment on why this new setting can prevent UPDATE anomalies.

In [79]:
# SQL statement
up2 = '''UPDATE may96c.keep_employees_RW SET W = 30 WHERE S = '454-44-5555';'''
cursor.execute(up2)

connection.commit()

UndefinedColumn: column "s" does not exist
LINE 1: UPDATE may96c.keep_employees_RW SET W = 30 WHERE S = '454-44...
                                                         ^

In [81]:
# Add your comments

print('This is not possible, because wage is not dependent on the employee in this database, it is based on a rating. The decomposition of the table prevented the breaking of company policy, in addition, there cannot be more than one wage associated with Rate as rate is the primary key and there is a functional dependency between the two')

This is not possible, because wage is not dependent on the employee in this database, it is based on a rating. The decomposition of the table prevented the breaking of company policy, in addition, there cannot be more than one wage associated with Rate as rate is the primary key and there is a functional dependency between the two

### Task 5: Use INSERT statement for two new employees. One follows the company policy to assign known wage and rating pair. The other is assigned a rating "5" but with a NULL value for the wage - the hiring manager has not decided the wage yet.  

* Is it possible? Comment on why this new setting can prevent INSERT anomalies.

In [84]:
# SQL statement

up3 = '''INSERT INTO may96c.keep_employees_SNLRH (S,N,L,R,H) VALUES ('818-18-8181', 'tim', 34, 4, 31)'''
cursor.execute(up3)

connection.commit()

In [88]:
up4 = '''INSERT INTO may96c.keep_employees_SNLRH (S,N,L,R,H) VALUES ('818-18-8182', 'liz', 34, 5, 31)'''
cursor.execute(up4)

connection.commit()

In [92]:
up4b = '''INSERT INTO may96c.keep_employees_RW (R) VALUES (5)'''
cursor.execute(up4b)

connection.commit()

UniqueViolation: duplicate key value violates unique constraint "keep_employees_rw_pkey"
DETAIL:  Key (r)=(5) already exists.

In [94]:
# Add your comments

print(' for the first employee, this works just fine, because their wage matches their rating, as company policy states. When it comes to the employee that should not be assaigned a wage yet, we see an issue. Because of the dependancy between R and W in the RW table, there cannot be a 5 rating not assaigned to the wage associated with a 5 rating.')

 for the first employee, this works just fine, because their wage matches their rating, as company policy states. When it comes to the employee that should not be assaigned a wage yet, we see an issue. Because of the dependancy between R and W in the RW table, there cannot be a 5 rating not assaigned to the wage associated with a 5 rating.

### Task 6: Use DELETE statement for all employees from the lowest rating due to performance issues.   

* List the tuples again based on ratings (ascending order) and comment on whether or not the company policy has been preserved. What could be DELETE anomaly you experience here.

### Use INSERT statement to add a new employee who will take the lowest rating with the wage associating with that rating.

* Is it possible? Comment on why this new setting can prevent DELETE anomalies.

In [97]:
# SQL statement

delete = 'DELETE FROM may96c.keep_employees_SNLRH WHERE R = 1' 

cursor.execute(dele)

connection.commit()

In [98]:
inst = '''INSERT INTO may96c.keep_employees_SNLRH (S,N,L,R,H) VALUES ('454-45-4545', 'bob', 33, 1, 35)'''
 

cursor.execute(inst)

connection.commit()

In [99]:
# Add your comments
print('this new setting prevents delete anomolies associated with this question because the wage associated with employees with the ranking of 1 has been preserved in the proper table')

this new setting prevents delete anomolies associated with this question because the wage associated with employees with the ranking of 1 has been preserved in the proper table

# Save your notebook, then `File > Close and Halt`